GAME_ANNOUNCEMENT = "🚨 <b>Анонс игры:</b>"
GAME_START = "🚀 <b>Игра стартует!</b>"
GAME_DATE_CHANGE = "⚠️ <b>Изменение дат игры:</b>"

MAIN_COMMANDS: dict[str, str] = {
    '/start': 'Запуск бота 🚀',
    '/subs': 'Мои подписки ',
    '/upcoming': 'Все предстоящие игры',
    '/active': 'Все активные игры',
    '/help': 'Помощь 🌎',
}

PRIVATE_COMMANDS: dict[str, str] = {
    '/start': 'Запуск бота 🚀',
    '/subs': 'Show subscriptions ',
    '/help': 'Помощь 🌎',
}

CHAT_COMMANDS: dict[str, str] = {
    '/help': 'Помощь 🌎',
}


NOT_NICKNAME = "⚠ У вас не установлен никнейм в Telegram.\n" \
            "Пожалуйста, перейдите в настройки Telegram и задайте имя пользователя (username)."
